<a href="https://colab.research.google.com/github/janaeam/correlating_movie_sales/blob/main/Alex_Python_Project_Movies.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# import libraries

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# read in data

df = pd.read_csv("/content/drive/MyDrive/Portfolio_Projects/movies.csv")

In [3]:
df

                                                name  ... runtime
0                                        The Shining  ...   146.0
1                                    The Blue Lagoon  ...   104.0
2     Star Wars: Episode V - The Empire Strikes Back  ...   124.0
3                                          Airplane!  ...    88.0
4                                         Caddyshack  ...    98.0
...                                              ...  ...     ...
7663                                    More to Life  ...    90.0
7664                                     Dream Round  ...    90.0
7665                                   Saving Mbango  ...     NaN
7666                                    It's Just Us  ...   120.0
7667                                       Tee em el  ...   102.0

[7668 rows x 15 columns]

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7668 entries, 0 to 7667
Data columns (total 15 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      7668 non-null   object
 1   rating    7591 non-null   object
 2   genre     7668 non-null   object
 3   year      7668 non-null   int64
 4   released  7666 non-null   object
 5   score     7665 non-null   float64
 6   votes     7665 non-null   float64
 7   director  7668 non-null   object
 8   writer    7665 non-null   object
 9   star      7667 non-null   object
 10  country   7665 non-null   object
 11  budget    5497 non-null   float64
 12  gross     7479 non-null   float64
 13  company   7651 non-null   object
 14  runtime   7664 non-null   float64
dtypes: float64(5), int64(1), object(9)
memory usage: 898.7+ KB

In [5]:
# checking for missing data

for col in df.columns:
    pct_missing = np.mean(df[col].isnull())
    print('{} - {}%'.format(col, pct_missing))

name - 0.0%
rating - 0.010041731872717789%
genre - 0.0%
year - 0.0%
released - 0.0002608242044861763%
score - 0.0003912363067292645%
votes - 0.0003912363067292645%
director - 0.0%
writer - 0.0003912363067292645%
star - 0.00013041210224308815%
country - 0.0003912363067292645%
budget - 0.2831246739697444%
gross - 0.02464788732394366%
company - 0.002217005738132499%
runtime - 0.0005216484089723526%

In [6]:
# checking for NaN ... How many in each column?

df.isnull().sum()

name           0
rating        77
genre          0
year           0
released       2
score          3
votes          3
director       0
writer         3
star           1
country        3
budget      2171
gross        189
company       17
runtime        4
dtype: int64

In [7]:
# Check out this website for information on changing datatypes and how
#    to deal with missing values: https://towardsdatascience.com/converting-data-to-a-numeric-type-in-pandas-db9415caab0b

# I learned that if we use the .astype code with 'Int64' instead 'int64'
#    we can for the dtype to change the NaN values to Na allowing the
#    dtype to become an integer. It turns out that NaN are considered a float

# Use this code to force the float to become an integer

df['budget'] = df['budget'].astype('Int64')

In [10]:
# It should now be an integer. The budget column will no longer contain
#    decimals and all NaNs will still be present

df.head(2)

              name rating      genre  ...       gross            company  runtime
0      The Shining      R      Drama  ...  46998772.0       Warner Bros.    146.0
1  The Blue Lagoon      R  Adventure  ...  58853106.0  Columbia Pictures    104.0

[2 rows x 15 columns]

In [12]:
# Double checking the dtypes

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7668 entries, 0 to 7667
Data columns (total 15 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      7668 non-null   object
 1   rating    7591 non-null   object
 2   genre     7668 non-null   object
 3   year      7668 non-null   int64
 4   released  7666 non-null   object
 5   score     7665 non-null   float64
 6   votes     7665 non-null   float64
 7   director  7668 non-null   object
 8   writer    7665 non-null   object
 9   star      7667 non-null   object
 10  country   7665 non-null   object
 11  budget    5497 non-null   Int64
 12  gross     7479 non-null   float64
 13  company   7651 non-null   object
 14  runtime   7664 non-null   float64
dtypes: Int64(1), float64(4), int64(1), object(9)
memory usage: 906.2+ KB

In [13]:
# We still need to drop the NaN values because Alex's dataset
#    doesn't contain any missing values so we will drop all rows
#    that contain even one Null value

df.dropna(inplace=True)

In [14]:
# deleting null values from dataset may not be the best way to 
#    handle the missing data, but it is quickest. As you learn more
#    more techniques and when you know what your employer is looking
#    for and the overall objective you'd like from your dataset you 
#    may choose a different way to deal with missing values

df.info()
# note that we are dropping all null values for the entire dataset with
#    df.dropna(inplace=True). The inplace=True allows us to overwrite the
#    original dataset to create a new datset moving forward. Our new dataset
#    will shrink by the total amount of rows that have missing values in them

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5421 entries, 0 to 7652
Data columns (total 15 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      5421 non-null   object
 1   rating    5421 non-null   object
 2   genre     5421 non-null   object
 3   year      5421 non-null   int64
 4   released  5421 non-null   object
 5   score     5421 non-null   float64
 6   votes     5421 non-null   float64
 7   director  5421 non-null   object
 8   writer    5421 non-null   object
 9   star      5421 non-null   object
 10  country   5421 non-null   object
 11  budget    5421 non-null   Int64
 12  gross     5421 non-null   float64
 13  company   5421 non-null   object
 14  runtime   5421 non-null   float64
dtypes: Int64(1), float64(4), int64(1), object(9)
memory usage: 682.9+ KB

In [16]:
# What are the datatypes

df.dtypes
# Notice that we have both int64 and Int64
# Also the 'gross' column is still a float

name         object
rating       object
genre        object
year          int64
released     object
score       float64
votes       float64
director     object
writer       object
star         object
country      object
budget        Int64
gross       float64
company      object
runtime     float64
dtype: object

In [17]:
# changing the datatype from float to int following Alex's code

df['budget'] = df['budget'].astype('int64')
df['gross'] = df['gross'].astype('int64')
# Note that the 'budget' column was not longer a float anyways, however if it
#    still were this code would now work because there are no more NaN values

In [19]:
# checking to see if worked

df.head()
# there are no more decimals except in the 'runtime' column

                                             name  ... runtime
0                                     The Shining  ...   146.0
1                                 The Blue Lagoon  ...   104.0
2  Star Wars: Episode V - The Empire Strikes Back  ...   124.0
3                                       Airplane!  ...    88.0
4                                      Caddyshack  ...    98.0

[5 rows x 15 columns]